In [1]:
import io
import pandas as pd
import numpy as np
import sqlite3

# CSV Estado

In [34]:
f_e = open('tenta/estados.csv', 'w')

In [35]:
estados = ['Acre','Alagoas','Amapá','Amazonas', 'Bahia', 'Ceará', 'Distrito Federal', 'Espírito Santo', 'Goiás', 'Maranhão',\
           'Mato Grosso', 'Mato Grosso do Sul', 'Minas Gerais', 'Pará', 'Paraíba', 'Paraná', 'Pernambuco', 'Piauí', 'Rio de Janeiro',\
          'Rio Grande do Norte', 'Rio Grande do Sul', 'Rondônia', 'Roraima', 'Santa Catarina', 'São Paulo', 'Sergipe','Tocantins', 'Não informado']
centro_oeste = ['Goiás', 'Mato Grosso' , 'Mato Grosso do Sul', 'Distrito Federal']
nordeste = ['Alagoas', 'Bahia', 'Ceará', 'Maranhão', 'Paraíba', 'Pernambuco', 'Piauí', 'Rio Grande do Norte' , 'Sergipe']
norte = ['Acre', 'Amapá', 'Amazonas', 'Pará', 'Rondônia', 'Roraima' , 'Tocantins']
sudeste = ['Espírito Santo', 'Minas Gerais', 'Rio de Janeiro' , 'São Paulo']
sul = ['Paraná', 'Rio Grande do Sul', 'Santa Catarina']

UFs = ['AC', 'AL', 'AP', 'AM', 'BA', 'CE', 'DF', 'ES', 'GO', 'MA', 'MT', 'MS', 'MG', 'PA', \
      'PB', 'PR', 'PE', 'PI', 'RJ', 'RN', 'RS', 'RO', 'RR', 'SC', 'SP', 'SE', 'TO', 'NI']
Pop = ['795.145','3.327.551', '756.500', '3.893.763', '15.150.143','8.867.448', '2.867.869','3.894.899', '6.551.322',\
      '6.861.924', '3.236.578','2.630.098', '20.777.672', '8.101.180', '3.950.359' , '11.112.062',\
      '9.297.861', '3.198.185', '16.497.395', '3.419.550', '11.228.091', '1.755.015',\
      '500.826', '6.734.568', '44.169.350', '2.227.294', '1.502.759', 'Não informado']

In [36]:
f_e.write('UF;Estado;Regiao;Número_habitantes\n')
for i in range(len(estados)):
    if estados[i] in centro_oeste:
        f_e.write(UFs[i]+ ';' + estados[i] +';'+ 'Centro-Oeste' +';'+Pop[i] +'\n')
    elif estados[i] in nordeste:        
        f_e.write(UFs[i]+ ';'+ estados[i] +';'+ 'Nordeste' +';'+Pop[i] +'\n')        
    elif estados[i] in norte:        
        f_e.write(UFs[i]+ ';'+ estados[i] +';'+ 'Norte' +';'+Pop[i] +'\n')
    elif estados[i] in sudeste:        
        f_e.write(UFs[i]+ ';'+ estados[i] +';'+ 'Sudeste' +';'+Pop[i] +'\n')
    elif estados[i] in sul:        
        f_e.write(UFs[i]+ ';'+ estados[i] +';'+ 'Sul' +';'+Pop[i] +'\n')
    else:
        f_e.write(UFs[i]+ ';'+ estados[i] +';'+ 'Não informado' +';'+Pop[i] +'\n')

In [37]:
f_e.close()

# CSV Data

In [3]:
f_d = open('tenta/data.csv', 'w')

In [4]:
ano = []
for i in range(1994,2019,1):
    ano.append(i)
    
mes = ['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho', 'Agosto',\
       'Setembro', 'Outubro', 'Novembro', 'Dezembro', 'Inexistente']
id_ = 0

In [5]:
f_d.write('ID_data;Ano;Mês\n')
for i in ano:
    for j in mes:
        f_d.write(str(id_)+ ';' + str(i) + ';' + j + '\n')
        id_ += 1

In [6]:
f_d.close()

# CSV Bioma

In [14]:
df = pd.read_csv('DataSets/desmatamento_bioma.csv', sep = ';')

In [16]:
f_b = open('upar/bioma.csv', 'w')

In [17]:
biomas = df['Bioma'].unique().tolist()
biomas.append('Amazônia Legal')

In [18]:
f_b.write('ID_Bioma;Bioma\n')
for i in range(len(biomas)):
    f_b.write(str(i) + ';' + biomas[i] + '\n')

In [19]:
f_b.close()

# CSV Produtos

In [15]:
df = pd.read_csv('tenta/extracao_pfm_1994-2016.csv', sep =';', encoding = 'latin-1')

In [16]:
aux = pd.DataFrame(df[['Tipo de produto extrativo','Tipo de Uso']])
aux.head(3)

  Tipo de produto extrativo   Tipo de Uso
0              Açaí (fruto)  Alimentícios
1              Açaí (fruto)  Alimentícios
2              Açaí (fruto)  Alimentícios

In [17]:
temp = []
for i, row in aux.iterrows():
    if (row['Tipo de produto extrativo'], row['Tipo de Uso']) not in temp:
        temp.append((row['Tipo de produto extrativo'], row['Tipo de Uso']))

In [18]:
temp[0:3]

[('Açaí (fruto)', 'Alimentícios'),
 ('Castanha de cajú', 'Alimentícios'),
 ('Castanha-do-Pará', 'Alimentícios')]

In [19]:
f_p = open('tenta/produtos.csv','w')

In [20]:
f_p.write('Tipo de produto extrativo;Tipo de Uso\n')
for item in temp:
    f_p.write(item[0] + ';' + item[1] +'\n')

In [21]:
f_p.close()

# Juntando CSVs sobre desmatamento

In [23]:
df1 = pd.read_csv('dados/desmatamento.csv', sep = ';')

In [25]:
df1.head(3)

,Ano,Bioma,Categoria,Estado,Numero_de_registros,Periodo,Area_desmatada_hec
0,2012,Amazônia Legal,Desflorestamento,Acre,1,2012,"2074194,28"
1,2012,Amazônia Legal,Desflorestamento,Amapá,1,2012,"300224,71"
2,2012,Amazônia Legal,Desflorestamento,Amazonas,1,2012,"3509103,62"

In [27]:
df2 = pd.read_csv('dados/desmatamento_bioma.csv', sep = ';')

In [28]:
df2.head(3)

      Bioma   Estado  Numero_de_registros  Periodo  Area_desmatada_hec
0  Caatinga  Alagoas                    1     2009         2877.130951
1  Caatinga    Bahia                    1     2009        61872.169510
2  Caatinga    Ceará                    1     2009        59130.915610

In [36]:
df1 = df1.drop(['Periodo', 'Categoria', 'Numero_de_registros'], axis = 1)

In [38]:
df1.head(3)

    Ano           Bioma    Estado Area_desmatada_hec
0  2012  Amazônia Legal      Acre         2074194,28
1  2012  Amazônia Legal     Amapá          300224,71
2  2012  Amazônia Legal  Amazonas         3509103,62

In [43]:
df2 = df2.rename({'Periodo' : 'Ano'}, axis = 'columns')
df2 = df2.drop('Numero_de_registros', axis = 1)

In [45]:
df2.head(3)

      Bioma   Estado   Ano  Area_desmatada_hec
0  Caatinga  Alagoas  2009         2877.130951
1  Caatinga    Bahia  2009        61872.169510
2  Caatinga    Ceará  2009        59130.915610

In [46]:
df2= df2[['Ano', 'Bioma', 'Estado', 'Area_desmatada_hec']]

In [47]:
df2.head(3)

    Ano     Bioma   Estado  Area_desmatada_hec
0  2009  Caatinga  Alagoas         2877.130951
1  2009  Caatinga    Bahia        61872.169510
2  2009  Caatinga    Ceará        59130.915610

In [51]:
df1 = df1.append(df2, ignore_index = True)

In [53]:
df1.head(3)

    Ano           Bioma    Estado Area_desmatada_hec
0  2012  Amazônia Legal      Acre         2074194,28
1  2012  Amazônia Legal     Amapá          300224,71
2  2012  Amazônia Legal  Amazonas         3509103,62

In [54]:
df1.tail(3)

      Ano     Bioma              Estado Area_desmatada_hec
98   2009     Pampa   Rio Grande do Sul            4593.25
99   2009  Pantanal         Mato Grosso            8921.56
100  2009  Pantanal  Mato Grosso do Sul            9925.75

In [56]:
data = pd.read_csv('tenta/data.csv', sep = ';')

In [4]:
data.head(13)

    ID_data   Ano          Mês
0         0  1994      Janeiro
1         1  1994    Fevereiro
2         2  1994        Março
3         3  1994        Abril
4         4  1994         Maio
5         5  1994        Junho
6         6  1994        Julho
7         7  1994       Agosto
8         8  1994     Setembro
9         9  1994      Outubro
10       10  1994     Novembro
11       11  1994     Dezembro
12       12  1994  Inexistente

In [56]:
#tive que colocar manualmente o nome das colunas
np.savetxt('tenta/desmatamento.csv', [p for p in zip(df1['Ano'], df1['Bioma'], df1['Estado'], df1['Area_desmatada_hec'])], delimiter=';', fmt='%s')

In [5]:
df1 = pd.read_csv('tenta/desmatamento.csv', sep = ';')

In [6]:
df1.head(3)

    Ano           Bioma    Estado Area_desmatada_hec
0  2012  Amazônia Legal      Acre         2074194,28
1  2012  Amazônia Legal     Amapá          300224,71
2  2012  Amazônia Legal  Amazonas         3509103,62

In [32]:
ID_data_arr = []
data_inex = data.where(data['Mês'] == 'Inexistente').dropna(how = 'all')
#data_inex
for i in range(len(df1)):
    ano = df1['Ano'].iloc[i]
    id_data = int(data_inex['ID_data'].where(data_inex['Ano'] == ano).dropna(how = 'all'))
    ID_data_arr.append(id_data)

In [36]:
df1['ID_data'] = ID_data_arr

In [42]:
df1 = df1.drop('Ano', axis = 1)
df1 = df1[['ID_data', 'Bioma', 'Estado', 'Area_desmatada_hec']]

In [43]:
df1.head(3)

   ID_data           Bioma    Estado Area_desmatada_hec
0      246  Amazônia Legal      Acre         2074194,28
1      246  Amazônia Legal     Amapá          300224,71
2      246  Amazônia Legal  Amazonas         3509103,62

In [51]:
f_d = open('upa/desmatamento.csv', 'w')

In [52]:
f_d.write('ID_data;Bioma;Estado;Area_desmatada_hec\n')
for row in zip(df1['ID_data'], df1['Bioma'], df1['Estado'], df1['Area_desmatada_hec']):
    linha = ''
    for i in range(len(row)):
        if i == len(row)-1:
             linha += str(row[i]) +'\n'
        else:
            linha += str(row[i]) +';'  
    f_d.write(linha)

In [53]:
f_d.close()

# Adequando o florestas_plantadas.csv

In [10]:
flo = pd.read_csv('DataSets/florestas_plantadas.csv', sep = ';' , encoding = 'latin-1')

In [41]:
flo.head(10)

    Ano    Cultura    Especie              Estado   Area_hec
0  2006  Eucalipto  Eucalipto        Minas Gerais  1181429.0
1  2006  Eucalipto  Eucalipto           São Paulo   915841.0
2  2006  Eucalipto  Eucalipto  Mato Grosso do Sul   119319.0
3  2006  Eucalipto  Eucalipto               Bahia   540172.0
4  2006  Eucalipto  Eucalipto   Rio Grande do Sul   184245.0
5  2006  Eucalipto  Eucalipto      Espírito Santo   207800.0
6  2006  Eucalipto  Eucalipto            Maranhão    93285.0
7  2006  Eucalipto  Eucalipto              Paraná   121908.0
8  2006  Eucalipto  Eucalipto         Mato Grosso   113770.0
9  2006  Eucalipto  Eucalipto                Pará   115806.0

In [39]:
estado_uf = list(zip(estados, UFs))
estado_uf[:3]

[('Acre', 'AC'), ('Alagoas', 'AL'), ('Amapá', 'AP')]

In [42]:
UF = []
for i in range(len(flo)):
    estado = str(flo['Estado'].iloc[i])
    for dupla in estado_uf:
        if dupla[0] == estado:
            uf = str(dupla[1])
    UF.append(uf)

In [44]:
flo['UF'] = UF

In [46]:
flo.head(3)

    Ano    Cultura    Especie              Estado   Area_hec  UF
0  2006  Eucalipto  Eucalipto        Minas Gerais  1181429.0  MG
1  2006  Eucalipto  Eucalipto           São Paulo   915841.0  SP
2  2006  Eucalipto  Eucalipto  Mato Grosso do Sul   119319.0  MS

In [53]:
flo.drop('Estado', axis = 1)
flo = flo[['Ano', 'UF', 'Especie', 'Area_hec']]
flo = flo.rename(columns = {'Area_hec': 'Area'})

In [54]:
flo.head(3)

    Ano  UF    Especie       Area
0  2006  MG  Eucalipto  1181429.0
1  2006  SP  Eucalipto   915841.0
2  2006  MS  Eucalipto   119319.0

In [60]:
ID_data_arr = []
data_inex = data.where(data['Mês'] == 'Inexistente').dropna(how = 'all')
#data_inex
for i in range(len(flo)):
    ano = flo['Ano'].iloc[i]
    id_data = int(data_inex['ID_data'].where(data_inex['Ano'] == ano).dropna(how = 'all'))
    ID_data_arr.append(id_data)

In [61]:
flo['ID_data'] = ID_data_arr

In [62]:
flo = flo.drop('Ano', axis = 1)
flo = flo[['ID_data', 'UF', 'Especie', 'Area']]

In [69]:
flo.head(3)

   ID_data  UF    Especie       Area
0      168  MG  Eucalipto  1181429.0
1      168  SP  Eucalipto   915841.0
2      168  MS  Eucalipto   119319.0

In [71]:
file_flo = open('tenta/florestas_plantadas.csv', 'w')

In [72]:
file_flo.write('ID_data;UF;Especie;Area\n')
for row in zip(flo['ID_data'], flo['UF'], flo['Especie'], flo['Area']):
    linha = ''
    for i in range(len(row)):
        if i == len(row)-1:
             linha += str(row[i]) +'\n'
        else:
            linha += str(row[i]) +';'  
    file_flo.write(linha)

In [73]:
file_flo.close()

# Biomas

In [5]:
f_bioma = pd.read_csv('DataSets/ucs-por-bioma-2018.csv', sep = ';', encoding = 'latin-1')

In [32]:
f_bioma = f_bioma.dropna(how = 'all')
#f_bioma = f_bioma.drop(6)
f_bioma = f_bioma.drop(7)

In [33]:
f_bioma

,Biomas,Área de Proteção Integral (ha),Área de Uso Sustentável (ha),Área total (ha),%
0,Amazônia,43.019.000,76.658.900,119.677.800,"73,74"
1,Caatinga,1.117.400,5.359.300,6.476.700,"3,99"
2,Cerrado,6.489.700,11.245.800,17.735.500,"10,93"
3,Pantanal,440.300,248.800,689.100,"0,42"
4,Mata Atlântica,2.871.100,8.671.900,11.543.100,"7,11"
5,Pampa,85.400,421.900,507.300,"0,31"

In [10]:
biomas_df = pd.read_csv('DataSets/bioma.csv', sep =';')

In [50]:
biomas_df

   ID_Bioma           Bioma
0         0        Caatinga
1         1         Cerrado
2         2  Mata Atlântica
3         3           Pampa
4         4        Pantanal
5         5  Amazônia Legal

In [22]:
list_biomas = biomas_df['Bioma'].unique().tolist()
list_biomas

['Caatinga',
 'Cerrado',
 'Mata Atlântica',
 'Pampa',
 'Pantanal',
 'Amazônia Legal']

In [48]:
area_protecao_integral = []
for i in range(len(f_bioma)):
    bioma = biomas_df['Bioma'].iloc[i]
    if bioma == 'Amazônia Legal':
        bioma = 'Amazônia'
    area = (f_bioma['Área de Proteção Integral (ha)'].where(f_bioma['Biomas'] == bioma).dropna(how = 'all')).tolist()
    area = area[0]
    area_protecao_integral.append(area)    
area_protecao_integral

['1.117.400', '6.489.700', '2.871.100', '85.400', '440.300', '43.019.000']

In [56]:
biomas_df['Área_proteção_integral'] = area_protecao_integral

In [57]:
biomas_df = biomas_df[['Bioma', 'Área_proteção_integral']]

In [58]:
biomas_df

            Bioma Área_proteção_integral
0        Caatinga              1.117.400
1         Cerrado              6.489.700
2  Mata Atlântica              2.871.100
3           Pampa                 85.400
4        Pantanal                440.300
5  Amazônia Legal             43.019.000

In [83]:
file = open('upar/bioma.csv', 'w')

In [84]:
file.write('Bioma;Área_proteção_integral\n')
for row in zip(biomas_df['Bioma'], biomas_df['Área_proteção_integral']):
    linha = ''
    for i in range(len(row)):
        if i == len(row)-1:
             linha += str(row[i]) +'\n'
        else:
            linha += str(row[i]) +';'        
    file.write(linha)

In [85]:
file.close()

# Concertando burradas

### Burrada no desmatamento

In [124]:
f = open('DataSets/desmatamento.csv', 'r')

In [125]:
arquivo = f.read()

In [127]:
f.close()

In [126]:
arquivo = arquivo.split('\n')

In [128]:
arquivo[:3]

['ID_data;Bioma;Estado;Area_desmatada_hec',
 '246;Amazônia Legal;Acre;2074194,28;',
 '246;Amazônia Legal;Amapá;300224,71;']

In [131]:
for i in range(1,len(arquivo)):
    arquivo[i] = arquivo[i][:-1]

In [132]:
arquivo[:3]

['ID_data;Bioma;Estado;Area_desmatada_hec',
 '246;Amazônia Legal;Acre;2074194,28',
 '246;Amazônia Legal;Amapá;300224,71']

In [136]:
f_desmatamento = open('upar/desmatamento.csv','w')

In [137]:
for line in arquivo:
    f_desmatamento.write(line + '\n')

In [138]:
f_desmatamento.close()

### Burrada no florestas_plantadas

In [145]:
f = open('DataSets/florestas_plantadas.csv', 'r')
arquivo = f.read()
arquivo = arquivo.split('\n')
f.close()

In [146]:
for i in range(1,len(arquivo)):
    arquivo[i] = arquivo[i][:-1]

In [147]:
f_florestas_plantadas = open('upar/florestas_plantadas.csv', 'w')

In [148]:
for line in arquivo:
    f_florestas_plantadas.write(line + '\n')

In [149]:
f_florestas_plantadas.close()

In [ ]:
###